101 32
116 104
116 32
115 32
105 110
44 32
101 114
97 110
111 110
101 110
100 32
114 101
257 256
111 117
121 32
260 103
226 128
111 114
97 32
116 105
46 32
111 32
102 32
105 259
97 114
271 32
97 108
101 108
105 116
111 278
101 115
99 104
97 258
110 111
116 277
58 32
109 101
272 148
263 266
275 264
73 32
115 116
121 269
289 258
99 111
267 115
98 101
260 32
115 105
101 261
97 116
273 32
118 262
102 105
265 32
99 256
108 105
119 104
98 117
117 114
97 259
101 259
46 10
257 288
101 266
314 258
114 105
117 110
114 111
114 97
109 32
257 32
119 105
309 283
262 32
263 32
298 32
99 116
101 308
115 104
100 105
111 108
301 264
272 153
338 263
97 295
108 101
100 261
115 261
115 256
84 104
103 104
119 97
115 258
105 258
99 101
116 262
109 270
262 256
99 264
110 32
114 32
119 32
115 101
109 256
117 108
118 256
101 120
109 111
282 32
276 73
101 97
265 116
267 97
87 104
328 327
108 111
97 98
97 112
108 270
121 261
110 101
102 307
334 270
339 259
115 283
287 32
10 65
112 111
108 32
81 291
276 346
108 266
108 256
97 99
329 266
100 101
272 156
272 157
318 386
102 273
115 111
114 117
318 10
265 311
261 321
303 268
279 299
101 287
63 383
405 291
99 105
97 103
102 101
115 112
109 112
113 117
59 32
276 296
109 273
286 259
119 273
109 105
119 101
265 258
269 110
340 311
280 256
394 32
279 268
107 32
101 333
370 288
99 305
295 32
315 256
280 287
108 97
264 32
257 101
98 256
260 290
117 116
298 357
263 103
100 111
269 388
257 111
117 109
269 347
118 281
302 300
105 108
118 105
271 261
117 267
432 284
109 97
397 292
302 116
112 262
98 111
455 419
101 118
116 111
313 310
395 428
101 100
107 256
112 324
313 354
115 265
334 32
341 32
458 310
335 105
279 274
103 110
329 100
286 261
409 283
269 258
292 259
260 116
77 101
313 288
100 256
257 281
112 301
286 115
115 117
105 99
300 45
109 98
324 326
97 326
316 274
101 112
264 256
312 446
282 105
263 110
101 116
118 101
452 427
102 490
99 315
284 270
480 443
117 349
99 267
445 32
98 270
263 115
119 442
104 444
284 259
381 102
261 268
387 256
377 358
257 262
337 100
306 352
97 115
102 325
109 368
257 114
348 121
304 108
367 382
257 330
101 280
322 497
97 117
275 99
65 529
100 277
106 505
523 507
404 111
293 274
111 112
109 262
100 262
264 103
101 258
293 32
323 102
112 361
112 280
110 468
304 98
119 280
119 356
112 104
261 274
265 99
524 259
285 268
261 294
340 351
116 114
312 464
112 519
119 316
257 279
264 375
457 327
102 262
366 258
415 256
77 270
381 278
32 32
292 415
282 385
108 108
110 416
296 491
384 115
116 265
282 554
108 260
108 385
116 363
104 97
269 115
304 264
105 115
459 310
104 111
265 351
336 115
109 420
258 285
102 97
105 114
105 278
115 97
116 97
268 391
292 261
282 108
102 116
404 277
476 32
118 111
110 277
284 380
115 407
101 343
116 398
101 99
263 100
276 568
339 258
440 117
613 408
306 256
421 100
412 286
116 325
373 477
292 263
521 333
99 331
103 117
105 357
504 266
284 121
260 266
97 348
98 114
111 550
335 374
267 502
337 266
118 317
329 343
99 295
256 285
369 100
309 114
366 356
108 614
403 274
115 305
275 478
116 261
347 258
265 429
297 398
396 109
260 352
107 289
473 105
286 258
276 69
392 493
281 268
98 369
454 483
118 305
328 257
576 548
105 109
114 284
322 112
115 315
509 119
117 115
544 518
108 541
257 331
312 297
267 300
355 606
323 540
115 271
539 103
102 565
340 429
488 506
267 102
105 100
302 99
290 436
287 440
260 118
297 97
105 297
545 345
116 315
639 349
560 110
467 345
304 434
116 267
486 98
364 349
259 285
532 274
115 99
302 281
299 274
101 676
265 100
672 652
261 296
103 325
364 522
284 376
582 362
454 644
435 624
273 105
269 357
533 332
109 438
447 360
112 267
276 65
119 256
673 583
110 97
511 331
115 275
291 268
115 337
107 265
116 259
102 361
292 489
104 528
301 112
109 121
112 108
346 256
370 310
364 590
102 260
263 258
587 358
112 32
117 258
263 311
112 433
447 478
299 534
276 66
685 284
355 308
532 97
530 345
115 121
449 629
447 109
294 268
119 663
558 509
276 84
109 117
320 508
280 32
111 517
571 270
100 305
348 270
421 266
259 268
396 256
99 108
603 105
525 400
103 101
347 116
98 616
553 421
103 260
276 89
265 275
308 270
111 111
313 105
269 116
280 270
83 111
99 32
417 100
282 111
108 100
260 304
110 485
280 105
731 264
372 103
313 277
99 107
328 580
102 267
484 400
302 767
411 312
115 293
748 115
336 786
109 260
500 431
531 32
802 623
112 97
115 277
115 107
286 116
267 729
648 333
300 108
321 274
306 317
500 451
295 261
300 109
350 279
286 344
651 119
99 442
336 677
441 317
342 258
257 354
301 104
435 270
115 262
104 280
374 112
97 441
418 114
110 612
109 264
107 101
417 388
341 261
641 256
70 307
290 268
303 274
267 282
275 362
293 268
98 273
269 259
99 430
108 305
63 32
257 260
682 750
121 542
102 283
288 268
10 10
511 263
103 105
108 284
112 322
116 323
632 304
42 42
671 265
97 287
533 299
284 513
300 573
104 262
581 258
359 101
324 115
285 274
661 448
110 307
304 473
276 735
105 335
100 97
108 117
98 390
99 263
363 112
460 337
111 267
259 294
121 257
378 268
97 799
99 372
689 110
107 281
418 115
300 411
108 416
353 488
282 261
833 114
99 280
269 32
100 117
284 569
336 297
359 256
609 258
479 265
666 262
260 256
746 741
660 477
100 330
44 424
116 380
110 266
399 73
373 389
342 97
298 114
355 116
366 278
111 98
868 374
410 367
462 425
417 787
112 116
471 600
97 438
263 116
471 109
100 283
65 73
112 101
108 306
110 363
608 256
103 265
121 293
401 274
280 107
116 330
830 835
279 290
774 352
560 356
286 293
117 259
117 365
275 109
119 284
694 489
108 281
308 32
97 382
617 430
417 266
111 527
104 887
462 279
854 258
342 103
276 72
100 265
115 281
46 424
344 321
116 389
366 913
792 487
275 360
105 411
300 482
414 491
406 296
98 265
114 958
326 285
283 270
463 103
111 109
654 778
264 101
99 262
832 120
257 827
267 266
367 327
98 593
297 114
276 87
935 258
99 258
371 268
289 116
617 295
101 109
549 265
105 527
320 290
115 317
119 367
363 687
291 274
97 997
276 79
496 362
342 280
680 342
267 108
99 97
983 596
65 296
101 411
423 299
407 112
293 331
720 574
410 97
98 325
107 627
261 290
570 570
501 268
98 324
372 119
471 740
783 292
758 304
281 290
335 32
538 265
546 984
109 361
412 105
275 118
704 122
100 306
589 725
769 311
318 65
1040 291
99 273
282 375
433 121
276 840
675 389
257 445
757 277
324 119
443 345
504 343
666 330
353 630
437 268
620 281
100 286
100 369
118 310
459 337
100 310
314 448
462 714
284 261
390 591
114 121
111 358
559 274
579 256
119 738
116 269
780 382
116 270
105 347
306 281
117 326
102 258
259 319
98 322
257 674
581 116
116 119
377 998
776 900
1018 311
104 316
1020 285
408 97
102 433
307 274
369 266
115 291
104 256
621 451
1009 341
267 365
664 112
335 97
259 290
975 987
316 594
300 763
387 288
496 499
101 293
304 411
79 961
297 493
460 771
264 612
274 516
103 114
257 286
796 412
851 426
567 670
413 350
119 354
387 354
260 297
628 726
261 299
502 114
110 820
112 520
638 270
449 548
302 928
456 105
116 116
297 273
566 425
104 373
484 588
753 271
270 285
109 261
549 266
413 605
112 273
104 264
399 346
97 100
306 305
452 905
520 107
115 320
951 952
585 834
620 271
723 580
898 273
287 779
281 378
103 303
100 325
344 268
99 599
297 610
268 625
351 112
267 453
476 259
883 427
118 320
695 967
276 76
299 492
896 500
801 469
401 268
662 408
332 423
292 498
262 261
363 1128
97 489
78 111
434 268
98 108
535 268
262 259
324 111
114 260
384 498
102 885
111 100
768 280
114 256
959 439
398 926
348 499
110 105
1011 479
302 121
117 112
882 299
269 114
285 353
318 383
846 356
274 495
679 306
889 102
571 376
671 310
406 734
261 379
107 260
387 279
101 102
263 351
264 266
359 506
1096 389
355 377
97 102
99 369
654 954
915 356
1062 1114
812 431
72 1066
811 330
686 805
109 263
732 569
99 322
280 322
513 45
785 259
267 891
1094 1026
302 271
826 279
276 83
115 264
862 362
281 285
265 259
100 103
107 310
453 287
465 99
538 310
99 325
104 831
294 274
937 262
384 101
372 358
1220 619
299 316
119 111
395 68
923 107
1070 287
752 815
632 584
558 361
595 360
336 267
1194 1212
773 790
303 353
260 105
279 331
279 564
392 112
1081 277
102 438
108 376
102 390
302 775
298 261
306 431
1007 110
114 270
504 100
657 257
655 330
100 1109
881 426
390 872
104 279
296 510
101 380
263 101
119 110
268 837
1168 380
103 97
104 354
334 121
454 494
283 385
1106 32
109 330
942 487
680 667
260 648
103 111
551 325
73 339
111 102
111 115
503 285
306 101
344 294
107 317
118 265
435 109
104 117
453 482
1259 270
1045 598
363 684
276 1027
665 592
116 404
118 286
305 321
84 277
267 933
276 67
100 281
1087 260
355 618
110 262
467 115
97 119
371 274
282 1125
557 293
413 296
539 978
400 285
1108 517
99 872
525 647
368 261
97 333
743 311
718 914
1033 275
467 643
773 782
717 336
101 364
297 262
268 698
102 312
602 268
108 271
824 299
1097 986
97 360
465 460
348 284
518 281
291 393
323 911
284 256
293 605
116 322
788 482
263 270
525 420
275 1015
461 332
751 110
306 380
804 285
297 261
881 107
395 1222
99 433
1004 416
918 569
510 332
806 256
104 681
335 280
73 278
930 1297
109 265
267 496
323 105
118 283
316 268
650 565
823 400
267 901
311 285
451 261
1347 333
469 285
99 572
260 416
577 275
119 306
756 649
521 103
530 257
304 297
668 271
422 319
682 1356
103 712
1037 97
109 485
1410 408
749 261
484 647
813 312
410 593
63 424
1061 258
715 948
115 426
1028 784
449 1019
387 101
279 547
321 268
108 485
384 1399
433 117
1112 256
312 772
929 1075
102 627
801 341
279 353
102 323
294 296
651 358
103 267
317 285
487 365
103 859
42 32
747 469
287 280
99 117
437 274
1113 553
373 448
409 760
664 733
396 326
98 283
921 829
728 32
114 263
811 262
721 360
264 305
930 539
780 410
730 116
289 119
621 431
920 332
298 339
777 1072
320 303
460 1137
604 669
1468 330
949 475
328 573
407 114
950 574
435 326
290 274
256 268
263 957
112 312
1126 389
317 268
1044 262
117 301
111 308
32 10
665 860
1059 117
699 664
919 260
260 258
276 82
688 285
668 281
988 257
753 281
595 121
287 273
336 1385
99 365
259 423
112 431
109 505
1127 270
1213 258
889 309
116 282
412 1430
298 406
263 429
751 297
282 1408
1510 257
289 483
689 356
1227 436
439 630
496 659
549 109
1105 375
306 577
112 498
116 310
1176 105
109 306
267 499
544 633
115 286
266 285
679 341
397 360
862 659
512 630
1270 431
1351 794
304 482
265 261
105 344
257 310
279 578
600 310
373 115
103 368
1253 1058
721 292
601 285
271 293
474 293
510 436
104 282
292 116
378 274
105 392
444 260
515 625
317 290
281 294
459 368
115 541
372 538
755 256
796 101
274 391
486 100
502 105
300 267
622 436
650 390
99 374
418 99
103 1049
747 341
109 408
103 810
481 279
401 492
257 487
260 1132
122 256
865 256
410 940
475 294
259 371
283 101
268 690
732 513
874 626
456 1520
896 1144
384 479
1008 333
774 941
1283 259
661 389
674 297
108 1552
720 789
861 281
686 531
115 384
336 103
301 337
894 342
108 264
600 330
351 105
309 120
372 111
111 1539
295 365
282 808
292 443
287 111
280 426
432 105
98 342
320 294
641 305
102 108
457 336
1293 483
300 392
102 322
325 358
342 1129
330 285
979 637
322 1419
286 401
378 598
1099 268
105 372
283 427
1323 275
520 426
922 345
271 259
114 264
976 109
287 97
418 686
1177 258
261 307
32 285
931 105
317 319
418 646
286 264
114 376
1357 813
319 379
898 307
410 390
457 100
470 667
575 299
265 352
292 542
1242 260
260 737
599 376
551 121
257 585
1122 368
621 365
836 493
97 624
418 784
325 527
106 111
1630 397
1631 322
355 102
348 362
923 426
985 633
283 108
366 110
303 439
104 633
303 562
1047 258
97 1603
441 326
1057 109
1035 503
377 119
296 866
265 775
399 734
723 573
115 414
259 307
704 430
601 319
369 287
275 292
286 1514
1381 1060
595 270
563 268
104 283
297 280
109 610
636 261
1263 317
323 103
717 407
1265 275
104 610
119 260
969 32
466 268
293 350
422 279
282 259
1422 270
592 448
116 121
396 103
441 109
373 342
115 413
450 274
544 260
1723 878
1069 290
758 382
927 281
419 105
98 262
370 354
116 117
10 386
589 300
112 1183
316 331
456 409
874 503
314 114
320 371
571 121
545 359
373 849
846 110
320 268
303 379
117 1043
391 285
693 285
803 100
1158 281
115 109
461 268
695 106
263 761
115 312
1497 584
100 269
551 1669
1472 1444
1161 260
453 464
270 319
99 1065
297 367
99 306
435 453
300 869
312 103
296 709
109 283
371 379
384 119
115 765
594 332
116 1287
118 97
297 325
399 83
1199 914
336 266
899 322
917 634
392 737
355 596
111 103
414 866
99 426
1375 714
107 305
990 105
323 275
1791 385
990 256
317 294
962 256
295 293
282 982
1317 644
988 327
104 105
876 365
321 492
1245 794
1246 1239
1302 345
581 645
536 281
1667 670
657 107
276 70
1593 779
1196 436
120 32
284 365
812 451
456 1160
99 485
101 121
112 105
985 518
355 309
109 281
340 258
256 290
730 32
276 428
260 1479
307 268
313 337
109 354
305 268
453 1309
277 332
484 420
257 1361
98 105
267 1513
1254 1696
290 267
260 262
788 297
1243 416
121 281
98 260
556 268
118 463
262 1286
275 499
297 282
466 379
472 495
461 274
108 610
1596 396
1107 32
259 402
744 274
474 45
406 76
276 77
296 561
323 1395
1766 531
1563 1305
283 1768
640 268
259 332
1350 1051
707 259
419 1073
1602 283
596 297
291 350
918 513
108 343
414 904
498 261
791 345
261 578
1152 345
99 341
1330 423
335 111
292 293
438 352
628 836
114 265
394 293
884 32
1487 116
462 824
989 440
1382 112
366 339
906 430
105 473
303 1071
296 692
325 336
73 356
1488 117
702 588
294 267
263 1368
1442 290
543 268
1047 116
465 411
631 256
302 1154
655 32
325 99
559 268
377 1817
109 519
280 275
260 110
1638 111
301 687
413 268
413 819
1821 103
372 362
302 310
257 261
359 412
280 585
394 856
312 109
460 111
669 32
265 103
399 66
105 349
972 294
463 293
638 281
712 1154
384 1489
109 627
313 262
1460 302
101 412
657 327
315 32
755 1521
471 112
712 775
534 274
1522 623
275 108
360 290
374 32
303 319
291 379
706 118
105 266
112 112
1216 352
291 299
1758 551
289 792
1759 284
289 275
1344 1478
475 268
1763 1849
116 1013
543 274
807 260
733 390
903 273
1175 400
303 294
471 1076
1605 320
281 319
302 104
302 530
1979 275
322 646
994 256
1402 522
289 358
276 863
359 546
119 492
364 931
102 1359
292 266
115 444
320 437
89 900
401 290
1273 110
293 294
462 1379
628 464
402 474
996 1618
305 274
100 742
115 368
1120 271
280 765
98 880
361 760
1403 273
353 391
1549 374
2010 104
546 116
100 320
281 274
104 1705
108 317
337 343
97 109
115 406
104 518
698 625
1443 103
417 343
112 530
859 262
759 268
100 293
323 1163
98 389
456 1236
668 450
481 296
1551 274
831 528
890 115
876 282
105 388
285 319
1676 1764
496 473
1562 1060
869 305
376 321
102 934
304 1033
471 308
1327 336
